1688/1688.3/Output/Inner-Fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant Inner-Fluid;

modules (CHT);

interfaces
{
  Interface1
  {
    mesh              Inner-Fluid-to-Solid;
    patches           (interface);
    
    readData
    (
      Sink-Temperature-Solid
      Heat-Transfer-Coefficient-Solid
    );
    
    writeData
    (
      Sink-Temperature-Inner-Fluid
      Heat-Transfer-Coefficient-Inner-Fluid
    );
  };
};